In [1]:
import numpy as np
import pandas as pd

my_df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Boston', 'Chicago']
})
my_df

      Name  Age      City
0    Alice   25  New York
1      Bob   30    Boston
2  Charlie   35   Chicago

In [2]:
# sorts by an axis:
my_df.sort_index(axis=1, ascending=False)

      Name      City  Age
0    Alice  New York   25
1      Bob    Boston   30
2  Charlie   Chicago   35

In [3]:
my_df.sort_values(by="City")

      Name  Age      City
1      Bob   30    Boston
2  Charlie   35   Chicago
0    Alice   25  New York